Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བློ་གྲོས་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of Sāgaramat

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་དེ་བཞིན་གཤེགས་པའི་གནས།
en: The Blessed One was staying at Rājagṛha, domain of the thus-gone ones, in a jeweled pavilion. It is the home of the thus-gone ones,

source: བསོད་ནམས་ཆེན་པོའི་རྒྱན་གྱི་ཚོགས་བསགས་པ། སྤྱོད་པ་ཆེན་པོའི་རྒྱུ་འཐུན་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པར་སྨིན་པས་མངོན་པར་གྲུབ་པ།
en: adorned with accumulations of great merit, produced by great deeds, the result of the ripening of all qualities of buddhahood;

source: བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་གནས།
en: the home of great bodhisattvas;

source: བསྟན་པ་མཐའ་ཡས་པ།
en: an infinite display;

source: དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྤྲུལ་པས་བྱིན་གྱིས་བརླབས་པ།
en: a place blessed with the thus-gone ones’ magic;

source: ཆགས་པ་མེད་པའི་སྤྱོད་ཡུལ་གྱི་ཡེ་ཤེས་ལ་འཇུག་པ།
en: an entry point to wisdom’s unobstructed domain;

source: དགའ་བ་རྒྱ་ཆེན་པོ་བསྐྱེད་པ།
en: a source of great joy;

source: དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པས་འཇུག་པ།
en: a gateway to mindfulness, intelligence, and realization;

source: ཀུན་ནས་མ་སྨད་པ།
en: a place without blame;

source: ཡེ་ཤེས་ཀྱིས་རྣམ་པར་དཔྱད་པ་དེ་ལ་མ་ཆགས་པར་རྟོགས་པས་འཇུག་པ།
en: a place formed with wisdom; a gateway to unobstructed wisdom;

source: བསྐལ་པ་མུ་མེད་པར་མངོན་པར་བསྟོད་པ།
en: a place that has been praised for limitless eons;

source: ཡོན་ཏན་གྱི་ཚོགས་ཐམས་ཅད་དཔག་ཏུ་མེད་པ་ན་བཞུགས་ཏེ
en: and a place that embodies an immeasurable accumulation of positive qualities.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་མཉམ་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: The Blessed One had perfectly realized the sameness of all phenomena.

source: ཆོས་ཀྱི་འཁོར་ལོ་ནི་ཤིན་ཏུ་བསྐོར།
en: He had set the wheel of Dharma in motion.

source: སློབ་མ་ཤིན་ཏུ་དུལ་བ་མཐའ་ཡས་པའི་ཚོགས་ནི་མངའ།
en: He led a limitless assembly of highly disciplined disciples.

source: ཆོས་ཐམས་ཅད་ལ་མངའ་དབང་ནི་བརྙེས།
en: He had achieved dominion over all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་སྒྲུབ་པ་ནི་ལེགས་པར་མཁྱེན།
en: He knew how to fulfill the intentions of all beings.

source: དབང་པོའི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བརྙེས།
en: He had achieved the sublime perfection of faculties.

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་འཇོམས་པ་ལ་ནི་མཁས།
en: He was skilled in destroying the binding force of habitual patterns.

source: སངས་རྒྱས་ཀྱི་མཛད་པ་ལྷུན་གྱིས་གྲུབ་པ་ནི་རྒྱུན་མ་ཆད་ཅིང་།
en: His awakened activities were spontaneous and unceasing.

source: དགེ་སློང་འབུམ་ཕྲག་དྲུག་ཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་སྟེ།
en: With him was a great monastic saṅgha of six million monks.

source: ཐམས་ཅད་ཀྱང་ཅང་ཤེས་ཀྱི་སེམས་དང་ལྡན་པ།
en: All of them had minds of great refinement.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་འཇོམས་པ་ལ་བརྩོན་པ།
en: They were diligently destroying the binding force of the habitual patterns of the afflictive emotions.

source: ཆོས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པའི་སྲས།
en: They were the progeny of the thus-gone Dharma kings.

source: ཆོས་ཟབ་མོ་ལ་གནས་པ།
en: They were immersed in the profound Dharma.

source: དམིགས་པ་མེད་པའི་ཆོས་ཀྱིས་ངེས་པར་བྱུང་བ།
en: They had found release through the Dharma of no apprehension.

source: སྤྱོད་ལམ་མཛེས་པ་ཕུན་སུམ་ཚོགས་པ།
en: They had perfectly gracious behavior.

source: སྦྱིན་གནས་ཆེན་པོར་གྱུར་པ།
en: They were worthy of offerings.

source: དེ་བཞིན་གཤེགས་པའི་བཀའ་ལ་ཤིན་ཏུ་ཞུགས་པ་ཤ་སྟག་གོ །
en: They were careful in following the word of the Thus-Gone One.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་པ་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པ།
en: There was also a great bodhisattva saṅgha there, which was composed of bodhisattva great beings who had attained the bodhisattva acceptance that nothing is apprehended.

source: དབང་བསྐུར་བ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་ཞུགས་པ།
en: They were on the bodhisattva levels where they received empowerment.

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེན་པ།
en: They played in the unconditioned super-knowledge of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་མི་ཟད་པའི་ཟ་མ་ཏོག་རབ་ཏུ་ཐོབ་པ།
en: They had received the casket containing inexhaustible bodhisattva dhāraṇīs.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དཔའ་བར་འགྲོ་བ་ལ་དབང་ཐོབ་པ།
en: They had attained mastery of the bodhisattva absorption of the heroic gait.

source: བྱང་ཆུབ་སེམས་དཔའི་སོ་སོ་ཡང་དག་པར་རིག་པ་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་རྗེས་སུ་ཐོབ་པ།
en: They had acquired the ability to satisfy all beings with the correct discriminations of the bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལྷུན་གྱིས་གྲུབ་པས་ངེས་པར་བྱུང་བ་བཀོད་པའི་རྒྱན་གྱི་ལྷག་པའི་བསམ་པ་ལ་ཤིན་ཏུ་གནས་པ།
en: Because their bodhisattva activity was spontaneous, they were steady in the pure motivation that is beautifully adorned with emancipation.

source: ཚད་མེད། གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། མཚུངས་པ་མེད། གཞལ་དུ་མེད། དཔག་ཏུ་མེད་པ་ལ་འདི་ལྟ་སྟེ།
en: There were limitless, countless, inconceivable, unmatchable, immeasurable, and unfathomable bodhisattva great beings present,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛོད་མི་ཟད་པ་ཞེས་བྱ་བ་དང་།
en: including the bodhisattva great being Inexhaustible Treasury,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་ཚད་མེད་པ་ཞེས་བྱ་བ་དང་།
en: the bodhisattva great being Limitless Intelligence,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་མཐའ་ཡས་ཞེས་བྱ་བ་དང་།
en: the bodhisattva great being Infinite Eloquence,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་པ་མེད་པའི་བསམ་གཏན་པ་ཞེས་བྱ་བ་དང་།
en: the bodhisattva great being Non-referential Concentration,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་གོང་ན་མེད་ཅེས་བྱ་བ་དང་།
en: the bodhisattva great being Unsurpassed Diligence,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བློ་གྲོས་ཞེས་བྱ་བ་དང་།
en: the bodhisattva great being Diligent Intelligence,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱུན་མི་འཆད་པ་ཞེས་བྱ་བ་དང་།
en: the bodhisattva great being Continuous Intelligence,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆགས་པ་མེད་པའི་མི་འཇིགས་པ་བརྩེགས་པ་ཞེས་བྱ་བ་དང་།
en: the bodhisattva great being Pinnacle of Nonattached Fearlessness,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་ངེས་པར་བརྟགས་ཏེ་
en: the bodhisattva great being Discerning Vision,

source: བལྟ་བ་ཞེས་བྱ་བ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད། གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། མཚུངས་པ་མེད། གཞལ་དུ་མེད། དཔག་ཏུ་མེད་པ་དག་དང་ཡང་ཐབས་ཅིག་གོ། །
en: as well as other limitless, countless, inconceivable, unmatchable, immeasurable, and unfathomable bodhisattva great beings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་ངེས་པར་འབྱུང་བ་སྒྲིབ་པ་མེད་པའི་སྒོ་བྱང་ཆུབ་སེམས་དཔའི་ལམ་བཀོད་པ་ལ་དམིགས་པ། སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: At that time the Blessed One gave a teaching on how to engage in bodhisattva conduct and thereby focus on liberation, the unobscured gateway, and the bodhisattva path.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་འགྲུབ་པའི་ཡེ་ཤེས་ཀྱི་འབྱུང་གནས་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བའི་གཟུངས་ཀྱི་ཕྱག་རྒྱའི་སྒོར་འཇུག་པ།
en: That teaching is the source of the wisdom that manifests all the strengths , fearlessnesses, and qualities of buddhahood. It is a gateway to the seal of dhāraṇī that masters all phenomena.

source: སོ་སོ་ཡང་དག་པར་རིག་པས་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་འཇུག་པའི་སྒོ།
en: It is a gateway to gaining certainty through the correct discriminations.

source: མངོན་པར་ཤེས་པ་ཆེན་པོའི་ཡེ་ཤེས་ལ་འབབ་པས་འཇུག་པ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཕྱིར་མི་ལྡོག་པ་སྟོན་པ།
en: It leads to the wisdom of great super-knowledge. It teaches the irreversibility of the irreversible wheel.

source: ཐེག་པ་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཡང་དག་པར་འདུ་བ།
en: It subsumes all vehicles within sameness.

source: ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་དེ་ཚུལ་གཅིག་པ་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ།
en: It shows how the realm of phenomena is unadulterated and a single principle.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་དབང་པོའི་ཚུལ་ལ་འཇུག་པ་སྟོན་པ།
en: It shows how to know the thoughts and faculties of all beings.

source: སྙིང་པོ་དང་ལྡན་པ།
en: It is that which is essential.

source: ཆོས་རྣམ་པར་གདོན་མི་ཟ་བ་དང་།
en: It leads to no doubt about the Dharma.

source: བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཇོམས་པ།
en: It defeats all the regions of Māra.

source: ཚུལ་བཞིན་དུ་ཆོས་ཀྱི་ཚུལ་ལ་འབབ་ཅིང་འཇུག་པ།
en: It shows how to appropriately enter and penetrate the Dharma way.

source: ཉོན་མོངས་པ་དང་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་འདུལ་བ།
en: It tames all afflictive emotions and views.

source: ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་འཇུག་པ།
en: It realizes unobstructed wisdom.

source: ཀུན་ཏུ་བསྔོ་བའི་ཐབས་ལ་མཁས་པ་ཤེས་པ་སྟོན་པ།
en: It teaches knowledge of the skillful method of dedication.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པ།
en: It realizes the wisdom of the sameness of all the buddhas.

source: ཆགས་པ་མེད་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྒོ་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་གདོན་མི་ཟ་བ་སྟོན་པ།
en: It shows the gateway of the blessings of nonattachment. It resolves all doubts about phenomena as they are.

source: མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོག་སྟེམཉམ་པ་ཉིད་དུ་འཇུག་པ།
en: It realizes sameness without thought or conceptuality.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོ་རྟོགས་པར་བྱེད་པ།
en: It gives rise to understanding of profound dependent origination.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོ་སོགས་པ།
en: It gathers the accumulations of merit and wisdom.

source: སངས་རྒྱས་ཀྱི་སྐུ་དང་གསུང་དང་ཐུགས་མཉམ་པ་ཉིད་ཀྱི་རྒྱན་དང་ལྡན་པ།
en: It possesses the ornaments of sameness, which are the body, speech, and mind of the buddhas.

source: དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོག་པ་དང་། མོས་པ་དང་། ཤེས་རབ་མི་ཟད་པ་མངོན་པར་སྒྲུབ་པ།
en: It accomplishes inexhaustible mindfulness, intelligence, understanding, aspiration, and insight.

source: ཉན་ཐོས་ཀྱི་ཐེག་པས་འདུལ་བའི་ཕྱིར་འཕགས་པའི་བདེན་པའི་ཚུལ་ལ་འཇུག་པ།
en: To guide through the vehicle of the hearers it shows the truths of the noble ones.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་འདུལ་བའི་ཕྱིར་ལུས་དང་སེམས་རབ་ཏུ་དབེན་པར་ཤེས་པ།
en: To guide through the vehicle of the solitary buddhas it teaches knowledge of physical and mental solitude.

source: ཐེག་པ་ཆེན་པོས་འདུལ་བའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པར་དབང་བསྐུར་བ་རབ་ཏུ་ཐོབ་པ།
en: To guide through the Great Vehicle it shows how to attain consecration into omniscience.

source: ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བའི་ཚུལ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་བརྗོད་པའི་ཕྱིར་
en: It shows how to gain mastery over all phenomena. Such was the Dharma teaching that the Blessed One taught in order to express the qualities of the thus-gone ones.

source: གསུང་ངོ་། །སྟོན་ཏོ། །རབ་ཏུ་འཆད་དོ། །འཛིན་དུ་འཇུག་གོ། །ཀློག་ཏུ་འཇུག་གོ། །
en: Thus he spoke it, taught it, explained it, encouraged memorization of it, encouraged recitation of it,

source: ཤེས་པར་མཛད་དོ། །རྣམ་པར་ཤེས་པར་མཛད་དོ། །རབ་ཏུ་ཤེས་པར་མཛད་དོ། །རབ་ཏུ་འགོད་དོ། །རྣམ་པར་འབྱེད་དོ། །རྣམ་པར་འགྲེལ་ཏོ། །གསལ་བར་མཛད་དོ། །
en: made it understood, made it well understood, made it very well understood, set it forth, defined it, proclaimed it, clarified it, and revealed it.

source: ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་ཤིན་ཏུ་རྣམ་པར་ངེས་པ་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པས་ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འོག་ཏུ་སའི་སྟེང་ནས་བཟུང་བ་ཡན་ཅད་རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་ཀྱི་གཞི་ལ་ཐུག་པའི་བར་དག་ཏུ་ཆུས་ཡོངས་སུ་གང་བའི་རྒྱ་མཚོ་གཅིག་ལྟར་ཀུན་ཏུ་སྣང་སྟེ
en: As the Blessed One extensively and genuinely delivered this Dharma teaching, which is a section of The Great Compilation , and that thoroughly ascertains what is true, the entire trichiliocosm, from the earth below up to the ground of the jeweled pavilion, became filled with water, as if it had become a single ocean.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བསྲེག་པའི་བསྐལ་པ་འདས་ནས་ཆགས་པ་འབྱུང་བའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ཆུས་ཡོངས་སུ་གང་བར་འགྱུར་ཏེ། ཆུའི་དཀྱིལ་འཁོར་གྱིས་ཡོངས་སུ་འཁོར་བ་དེ་བཞིན་དུ།
en: The entire trichiliocosm was flooded with water, just as happens during the eon of formation, which follows the eon of burning, when everything is covered by a mass of water.

source: དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཆུས་ཡོངས་སུ་གང་བའི་རྒྱ་མཚོ་གཅིག་ལྟ་བུར་གནས་པར་ཀུན་ཏུ་སྣང་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་ལ་ཡང་སྒྲིབ་པ་མེད་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: However, although all the worlds in the trichiliocosm appeared to be filled with water as in a single ocean, still all the villages, cities, towns, lands, regions, and palaces could be seen without obstruction.

source: འཛམ་བུའི་གླིང་རྣམས་དང་། གླིང་བཞི་པ་ཆེན་པོ་རྣམས་དང་། རྒྱ་མཚོ་ཆེན་པོ་རྣམས་དང་། རི་རབ་རྣམས་དང་། འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ལ་ཡང་སྔོན་ཇི་ལྟར་ཕྱིས་ཀྱང་དེ་བཞིན་དུ་སྒྲིབ་པ་ཅི་ཡང་མེད་པར་དེ་ཁོ་ན་བཞིན་དུ་ཀུན་དུ་སྣང་ངོ་། །
en: Additionally, all the Jambudvīpas, four-continent worlds, great oceans, Mount Merus, and gods of the desire realm were clearly visible, just as they normally are.

source: ཆུའི་ཕུང་པོ་དེ་ལས་ཀྱང་པད་མ་
en: Lotuses sprang from this mass of water.

source: ཆུ་བ་ནི་བཻ་དཱུརྱ། སྡོང་བུ་ནི་ཨན་ད་རྙིལ། ལོ་མ་ནི་འཛམ་བུའི་ཆུ་བོའི་གསེར། ཟེ་བ་ནི་དཔལ་གྱི་སྙིང་པོ། སྙིང་པོ་ནི་རྡོའི་སྙིང་པོ་ལས་གྲུབ་པ།
en: Their branches were made of beryl, their stalks of sapphire, their leaves of gold from the Jambu River, their stamens of śrīgarbha gems, and their hearts of emerald.

source: མུ་ཏིག་གི་དྲ་བས་ནི་ཁེབས་པར་བྱས་པ།
en: They were draped with nets of pearls.

source: འདབ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལྡན་པ།
en: They had many trillions of petals.

source: ཚད་ནི་རྒྱང་གྲགས་ཀྱི་ཁྱོན་ཙམ་ཡོད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བྱུང་སྟེ
en: In terms of their size, they were many trillions of miles wide.

source: དེ་དག་རིན་པོ་ཆེའི་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་ཀྱི་གཞི་ལས་ཐལ་ནས་ཤིང་ཏ་ལའི་སྲིད་དུ་འཕགས་ཏེ།
en: They rose from the base of the jeweled pavilion up to the height of a palm tree.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཡང་དེའི་ཚེ་པད་མ་ལ་འཁོད་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: The entire assembly then appeared arranged on those lotuses.

source: པད་མ་དེ་དག་ལས་ཀྱང་འོད་གང་དག་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་གྲངས་མེད་པ་དག་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་པའི་འོད་དེ་ལྟ་བུ་དག་བྱུང་ངོ་། །
en: A light issued forth from the lotuses such that limitless, countless buddha realms throughout the ten directions were pervaded by a tremendous brightness.

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས་ཇི་ལྟར་སྔ་ལྟས་འདི་དག་ཀུན་ཏུ་སྣང་བ་ལས་ན།
en: The entire assembly was amazed at this, and said to themselves about the revelation of these omens,

source: ཀྱེ་མའོ་འདི་ནི་ཆོས་བསྟན་པ་ཆེན་པོར་འགྱུར་རོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: “This means an important teaching is coming!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ཆོ་འཕྲུལ་ཆེན་པོ་དེ་མཐོང་ནས་པད་མའི་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་སྙིང་པོ་ལ་བཙུགས་ཏེ།
en: Upon seeing this great magical display, the bodhisattva great being Maitreya stood up from his lotus seat, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms together he bowed toward the Blessed One and asked,

source: བཅོམ་ལྡན་འདས་གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཆབ་ཀྱིས་ཡོངས་སུ་གཏམས་པའི་རྒྱ་མཚོ་གཅིག་ལྟ་བུར་ཀུན་ཏུ་གདའ་བ་དང་། པད་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་འདི་སྙེད་ཅིག་མངོན་པར་བྱུང་བ་འདི་དག་དང་། བཅོམ་ལྡན་འདས་སྔོན་མ་མཐོང་མ་ཐོས་པའི་ཆོ་འཕྲུལ་རྒྱ་ཆེན་པོ་འདི་དག་ཀུན་ཏུ་གདའ་བ་འདི་དག་སུའི་སྔ་ལྟས་ལགས།
en: “Blessed One, whose prophecy is represented by the worlds of the trichiliocosm being filled with water like a single ocean, the manifestation of these trillions of lotuses, and this vast magical display like none we have ever heard of or seen before?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered the bodhisattva great being Maitreya, saying,

source: བྱམས་པ་འོག་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་དྲི་མ་དང་བྲལ་བ་དཔག་ཏུ་མེད་པ་བཀོད་པས་བརྒྱན་པ་ཞེས་བྱ་བ་
en: “Maitreya, below this buddha realm, beyond as many buddha realms as there are atoms in all the worlds of the trichiliocosm, is the world Adorned with Immaculate and Countless Precious Qualities.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱ་མཚོའི་མཆོག་མངའ་བའི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་འཕགས་པའི་མངོན་པར་མཁྱེན་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་
en: There dwells the thus-gone, worthy, perfect buddha Master of the Ocean with Noble and Playful Super-knowledge.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་ཡོད་དེ
en: He lives there and is teaching the Dharma.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་དག་དང་ལྷན་ཅིག་ཏུ་ང་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་།
en: In that buddha realm, the bodhisattva great being Sāgaramati and countless other bodhisattva great beings are gazing at me, venerating me, and honoring me.

source: ཆོས་བསྟན་པ་འདི་ལས་གཏམ་གྱི་རྒྱུད་འགའ་ཞིག་དྲི་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་འོང་བར་འགྱུར་ཏེའདི་ནི་དེའི་སྔ་ལྟས་སོ། །
en: They are coming to the Sahā world to ask questions about the present Dharma teaching. This is what the omen symbolized.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Śāriputra asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: “Blessed One, how can this be?

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ཐག་རིང་པོ་དེ་སྲིད་ཅིག་ན་མཆིས་ཤིང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་ལགས་སམ།
en: If the bodhisattva Sāgaramati is so far away, how is he listening to this teaching?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་
en: “Śāriputra,” answered the Blessed One,

source: ཁྱོད་ཇི་ལྟར་ངའི་མདུན་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ཡང་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་འདུག་ཅིང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་ཏོ། །
en: “the bodhisattva Sāgaramati is listening to this Dharma teaching from that world in the same way that you are listening to it in my presence.

source: ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་ཇི་ལྟར་ང་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་མཐོང་བདེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་ཀྱང་ང་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་མཐོང་ངོ་། །
en: Śāriputra, the bodhisattva Sāgaramati can see me and the entire assembly just like you can.”

source: བཅོམ་ལྡན་འདས་ཀྱེ་མའོ་ཅི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་འདི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: “Blessed One, how amazing! The power of the wisdom of bodhisattva great beings’ super-knowledge is unfathomable.

source: འདི་ལྟར་ཐག་རིང་པོ་དེ་སྲིད་ན་མཆིས་ཀྱང་མིག་གིས་གཟུགས་མཐོང་བ་ལ་སྒྲིབ་པ་མ་མཆིས་ཤིང་རྣ་བས་སྒྲ་ཐོས་པ་ལ་སྒྲིབ་པ་མ་མཆིས་པ་ནི་ངོ་མཚར་ཏོ། །
en: It is incredible that even from such a distance his eyes can see such forms and his ears can hear such sounds without obscuration.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ཐོས་ནས་སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མི་བསྐྱེད།
en: Blessed One, how could anyone who hears of the unfathomable greatness of the qualities of bodhisattva great beings not develop the mind directed toward unsurpassed and perfect awakening?”

source: གནས་བརྟན་ཤཱ་རིའི་བུས་བསྟན་པ་འདི་བཤད་པའི་ཚེ་ལྷའི་བུ་ཉི་ཁྲི་བཞི་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When the elder Śāriputra made this observation, forty-two thousand gods developed the mind directed toward unsurpassed and perfect awakening.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཀུན་ནས་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་ལྷན་ཅིག་ཏུ། བཅོམ་ལྡན་འདས་རྒྱ་མཚོའི་མཆོག་མངའ་བའི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་འཕགས་པའི་མངོན་པར་མཁྱེན་པའི་དེ་བཞིན་གཤེགས་པ་དེ་ལ་གསོལ་ནསབཅོམ་ལྡན་འདས་དེས་གནང་སྟེ།
en: At this point, the bodhisattva great being Sāgaramati, accompanied and attended on by countless other bodhisattva great beings, requested permission to take leave from the thus-gone Master of the Ocean with Noble and Playful Super-knowledge, which that blessed one granted him.

source: སངས་རྒྱས་རྣམ་པར་རོལ་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་དང་། སེམས་གཅིག་གིས་ཐོབ་པའི་དྲན་པས་མིག་ཕྱེ་བ་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེའི་དྲི་མ་དང་བྲལ་བ་དཔག་ཏུ་མེད་པ་བཀོད་པས་བརྒྱན་པ་དེ་ནས་མི་སྣང་བར་གྱུར་ནསའཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏེ། རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་ཀྱི་གཞི་ལས་ཐལ་ནས་ཤིང་ཏ་ལ་བདུན་ཙམ་དུ་མངོན་པར་འཕགས་ཏེ་
en: Then, in the blink of an eye, through the Buddha’s playfully engaging in the bases of miracles, his unconditioned miracles, and the mindfulness attained by a one-pointed mind, they disappeared from the world Adorned with Immaculate and Countless Precious Qualities and arrived at the Sahā world.

source: པད་མའི་སྙིང་པོ་ལ་འདུག་པར་ཀུན་ཏུ་སྣང་ངོ་། །དེ་ལས་གཞན་པའི་པད་མའི་སྙིང་པོ་རྣམས་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་འཁོད་པར་ཀུན་ཏུ་སྣང་ངོ་། །འོག་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་གྲངས་མེད་པ་དག་ནས་
en: He appeared in the heart of a lotus elevated to the height of seven palm trees above the base of the jeweled pavilion.

source: ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཆོས་ཉན་པའི་ཕྱིར་
en: The other bodhisattva great beings also appeared arrayed in the hearts of the lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོའི་ཕྱི་བཞིན་དུ་འབྲང་བར་གྱུར་ཏོ། །
en: More and more countless and immeasurable numbers of bodhisattva great beings followed the bodhisattva great being Sāgaramati from other countless buddha realms in the lower direction to hear the Dharma.

source: དེ་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མ་ལ་འཁོད་པ་དག་གིས་རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་ཤིན་ཏུ་རྒྱས་པས་མཛེས་ཏེ། ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེའོ། །
en: These bodhisattva great beings gathered from worlds throughout the ten directions and arrayed themselves on the lotuses. They beautified the jeweled pavilion to a great degree as they shimmered, glimmered, and glittered.

source: དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: The entire assembly was astonished.

source: དགའ་བ་དང་། དང་བ་དང་། རབ་ཏུ་དགའ་བ་ཐོབ་ནས་ཐལ་མོ་སྦྱར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཕྱག་འཚལ་ཏོ། །
en: They joined their palms together in joy, faith, and happiness and prostrated to these bodhisattvas.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོས་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་དྲི་མ་དང་བྲལ་བ་དཔག་ཏུ་མེད་པ་བཀོད་པས་བརྒྱན་པ་ན་ཡོད་པའི་མེ་ཏོག་མྱ་ངན་མེད་ཅིང་ཡིད་དུ་འོང་བ་མཐོང་ན་དགའ་བ་ཞེས་བྱ་བ་
en: Then, in an act of veneration, the bodhisattva great being Sāgaramati caused a great rain of flowers to fall in front of the Blessed One. The flowers, which were from the world Adorned with Immaculate and Countless Precious Qualities, were known as “delightful, pleasing, and lovely to behold.”

source: འདབ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྡན་པ། ཚད་རྒྱང་གྲགས་ཀྱི་ཁྱོན་ཙམ་ཡོད་པ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་འོས་པ།
en: They were replete with trillions of petals, a full mile across, and worthy of offering to a thus-gone one.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པས་རྣམ་པར་དག་པ་སྔོན་གྱི་དགེ་བའི་རྩ་བས་ཡོངས་སུ་སྦྱངས་པ།
en: The rain was the product of the bodhisattva’s pure intentions and purified by previous roots of virtue.
